[
    "If ARESETn is LOW and VALID is LOW, then ARESETn is HIGH in the next cycle.",
    "If ARESETn is LOW and VALID is LOW, then VALID is LOW in the next cycle.",
    "If ARESETn is HIGH and VALID is LOW, then ARESETn is HIGH in the next cycle.",
    "If ARESETn is HIGH and VALID is LOW, then VALID is HIGH in the next cycle.",
    "If ARESETn is HIGH and VALID is HIGH, then ARESETn is HIGH in the next cycle.",
    "If ARESETn is HIGH and VALID is HIGH, then VALID is HIGH in the next cycle.",
    "If ARESETn is LOW and VALID is LOW, then VALID remains stable in the next cycle.",
    "If ARESETn is HIGH and VALID is LOW, then ARESETn remains stable in the next cycle.",
    "If ARESETn is HIGH and VALID is HIGH, then ARESETn remains stable in the next cycle.",
    "If ARESETn is HIGH and VALID is HIGH, then VALID remains stable in the next cycle.",
    "If ARESETn changes from LOW to HIGH, then VALID is LOW.",
    "If VALID changes from LOW to HIGH, then ARESETn is HIGH.",
    "If ARESETn changes from LOW to HIGH, then ARESETn is LOW or VALID is LOW.",
    "If VALID changes from LOW to HIGH, then ARESETn is HIGH or VALID is LOW.",
    "If ARESETn is LOW, then VALID is LOW.",
    "If VALID is HIGH, then ARESETn is HIGH.",
    "If ARESETn is LOW, then ARESETn is HIGH in the next cycle.",
    "If ARESETn is LOW, then VALID is LOW in the next cycle.",
    "If ARESETn is HIGH, then ARESETn is HIGH in the next cycle.",
    "If ARESETn is HIGH, then VALID is HIGH in the next cycle.",
    "If VALID is LOW, then ARESETn is HIGH in the next cycle.",
    "If VALID is HIGH, then ARESETn is HIGH in the next cycle.",
    "If VALID is HIGH, then VALID is HIGH in the next cycle.",
    "If ARESETn is LOW, then ARESETn is LOW or VALID is LOW in the next cycle.",
    "If ARESETn is LOW, then ARESETn is HIGH or VALID is LOW in the next cycle.",
    "If ARESETn is LOW, then ARESETn is HIGH or VALID is HIGH in the next cycle.",
    "If ARESETn is HIGH, then ARESETn is LOW or VALID is HIGH in the next cycle.",
    "If ARESETn is HIGH, then ARESETn is HIGH or VALID is LOW in the next cycle.",
    "If ARESETn is HIGH, then ARESETn is HIGH or VALID is HIGH in the next cycle.",
    "If VALID is LOW, then ARESETn is HIGH or VALID is LOW in the next cycle.",
    "If VALID is LOW, then ARESETn is HIGH or VALID is HIGH in the next cycle.",
    "If VALID is HIGH, then ARESETn is LOW or VALID is HIGH in the next cycle.",
    "If VALID is HIGH, then ARESETn is HIGH or VALID is LOW in the next cycle.",
    "If VALID is HIGH, then ARESETn is HIGH or VALID is HIGH in the next cycle."
]