[
    "If QACCEPTn is LOW and QDENY is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH, then QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH, then QDENY is LOW in the next cycle.",
    "If QDENY is LOW and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QDENY is LOW and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QDENY is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QREQn is LOW and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QREQn is LOW and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QREQn is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QREQn is HIGH and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QREQn is HIGH and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH, then QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is HIGH, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is HIGH, then QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW, then QREQn is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW and RESETn is HIGH, then QREQn is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH and RESETn is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QDENY is LOW and QREQn is LOW and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QDENY is LOW and QREQn is LOW and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QREQn is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH, then QDENY remains stable in the next cycle.",
    "If QDENY is LOW and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QDENY is LOW and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QDENY is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QREQn is LOW and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QREQn is LOW and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QREQn is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QREQn is HIGH and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QREQn is HIGH and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is HIGH, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW and RESETn is HIGH, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH and RESETn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QREQn is HIGH and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is LOW and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is LOW and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is LOW and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then RESETn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is LOW and QREQn is HIGH and RESETn is HIGH, then QDENY remains stable in the next cycle.",
    "If RESETn changes from LOW to HIGH, then QACCEPTn is LOW.",
    "If RESETn changes from LOW to HIGH, then QDENY is LOW.",
    "If QACCEPTn changes from LOW to HIGH, then RESETn is HIGH.",
    "If QACCEPTn changes from LOW to HIGH, then QREQn is HIGH.",
    "If QACCEPTn changes from LOW to HIGH, then QDENY is LOW.",
    "If RESETn changes from HIGH to LOW, then QREQn is LOW.",
    "If RESETn changes from HIGH to LOW, then QACCEPTn is LOW.",
    "If RESETn changes from HIGH to LOW, then QDENY is LOW.",
    "If QREQn changes from HIGH to LOW, then RESETn is HIGH.",
    "If QREQn changes from HIGH to LOW, then QACCEPTn is HIGH.",
    "If QREQn changes from HIGH to LOW, then QDENY is LOW.",
    "If QACCEPTn changes from HIGH to LOW, then RESETn is HIGH.",
    "If QACCEPTn changes from HIGH to LOW, then QREQn is LOW.",
    "If QACCEPTn changes from HIGH to LOW, then QDENY is LOW.",
    "If RESETn changes from LOW to HIGH, then QACCEPTn is LOW and QDENY is LOW.",
    "If RESETn changes from LOW to HIGH, then QACCEPTn is LOW and RESETn is HIGH.",
    "If RESETn changes from LOW to HIGH, then QDENY is LOW and RESETn is HIGH.",
    "If QACCEPTn changes from LOW to HIGH, then QACCEPTn is HIGH and QDENY is LOW.",
    "If QACCEPTn changes from LOW to HIGH, then QACCEPTn is HIGH and QREQn is HIGH.",
    "If QACCEPTn changes from LOW to HIGH, then QACCEPTn is HIGH and RESETn is HIGH.",
    "If QACCEPTn changes from LOW to HIGH, then QDENY is LOW and QREQn is HIGH.",
    "If QACCEPTn changes from LOW to HIGH, then QDENY is LOW and RESETn is HIGH.",
    "If QACCEPTn changes from LOW to HIGH, then QREQn is HIGH and RESETn is HIGH.",
    "If RESETn changes from HIGH to LOW, then QACCEPTn is LOW and QDENY is LOW.",
    "If RESETn changes from HIGH to LOW, then QACCEPTn is LOW and QREQn is LOW.",
    "If RESETn changes from HIGH to LOW, then QACCEPTn is LOW and RESETn is LOW.",
    "If RESETn changes from HIGH to LOW, then QDENY is LOW and QREQn is LOW.",
    "If RESETn changes from HIGH to LOW, then QDENY is LOW and RESETn is LOW.",
    "If RESETn changes from HIGH to LOW, then QREQn is LOW and RESETn is LOW.",
    "If QREQn changes from HIGH to LOW, then QACCEPTn is HIGH and QDENY is LOW.",
    "If QREQn changes from HIGH to LOW, then QACCEPTn is HIGH and QREQn is LOW.",
    "If QREQn changes from HIGH to LOW, then QACCEPTn is HIGH and RESETn is HIGH.",
    "If QREQn changes from HIGH to LOW, then QDENY is LOW and QREQn is LOW.",
    "If QREQn changes from HIGH to LOW, then QDENY is LOW and RESETn is HIGH.",
    "If QREQn changes from HIGH to LOW, then QREQn is LOW and RESETn is HIGH.",
    "If QACCEPTn changes from HIGH to LOW, then QACCEPTn is LOW and QDENY is LOW.",
    "If QACCEPTn changes from HIGH to LOW, then QACCEPTn is LOW and QREQn is LOW.",
    "If QACCEPTn changes from HIGH to LOW, then QACCEPTn is LOW and RESETn is HIGH.",
    "If QACCEPTn changes from HIGH to LOW, then QDENY is LOW and QREQn is LOW.",
    "If QACCEPTn changes from HIGH to LOW, then QDENY is LOW and RESETn is HIGH.",
    "If QACCEPTn changes from HIGH to LOW, then QREQn is LOW and RESETn is HIGH.",
    "If RESETn is LOW, then QACCEPTn is LOW.",
    "If RESETn is LOW, then QDENY is LOW.",
    "If RESETn is HIGH, then QDENY is LOW.",
    "If QACCEPTn is LOW, then QDENY is LOW.",
    "If QACCEPTn is HIGH, then RESETn is HIGH.",
    "If RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If RESETn is HIGH, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH, then RESETn is HIGH in the next cycle.",
    "If RESETn is LOW, then QACCEPTn is LOW or QDENY is LOW in the next cycle.",
    "If RESETn is LOW, then QACCEPTn is LOW or QDENY is HIGH in the next cycle.",
    "If RESETn is LOW, then QACCEPTn is LOW or QREQn is LOW in the next cycle.",
    "If RESETn is LOW, then QACCEPTn is LOW or QREQn is HIGH in the next cycle.",
    "If RESETn is LOW, then QACCEPTn is LOW or RESETn is LOW in the next cycle.",
    "If RESETn is LOW, then QACCEPTn is LOW or RESETn is HIGH in the next cycle.",
    "If RESETn is LOW, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If RESETn is LOW, then QDENY is LOW or QREQn is LOW in the next cycle.",
    "If RESETn is LOW, then QDENY is LOW or QREQn is HIGH in the next cycle.",
    "If RESETn is LOW, then QDENY is LOW or RESETn is LOW in the next cycle.",
    "If RESETn is LOW, then QDENY is LOW or RESETn is HIGH in the next cycle.",
    "If RESETn is HIGH, then QACCEPTn is LOW or QDENY is LOW in the next cycle.",
    "If RESETn is HIGH, then QACCEPTn is LOW or RESETn is HIGH in the next cycle.",
    "If RESETn is HIGH, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If RESETn is HIGH, then QDENY is LOW or QREQn is LOW in the next cycle.",
    "If RESETn is HIGH, then QDENY is LOW or QREQn is HIGH in the next cycle.",
    "If RESETn is HIGH, then QDENY is LOW or RESETn is LOW in the next cycle.",
    "If RESETn is HIGH, then QDENY is LOW or RESETn is HIGH in the next cycle.",
    "If RESETn is HIGH, then QREQn is LOW or RESETn is HIGH in the next cycle.",
    "If QREQn is LOW, then QACCEPTn is LOW or RESETn is HIGH in the next cycle.",
    "If QREQn is LOW, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If QREQn is LOW, then QDENY is LOW or RESETn is LOW in the next cycle.",
    "If QREQn is LOW, then QDENY is LOW or RESETn is HIGH in the next cycle.",
    "If QREQn is HIGH, then QACCEPTn is LOW or RESETn is HIGH in the next cycle.",
    "If QREQn is HIGH, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If QREQn is HIGH, then QACCEPTn is HIGH or QREQn is HIGH in the next cycle.",
    "If QREQn is HIGH, then QDENY is LOW or QREQn is HIGH in the next cycle.",
    "If QREQn is HIGH, then QDENY is LOW or RESETn is LOW in the next cycle.",
    "If QREQn is HIGH, then QDENY is LOW or RESETn is HIGH in the next cycle.",
    "If QREQn is HIGH, then QREQn is HIGH or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is LOW, then QACCEPTn is LOW or QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW, then QACCEPTn is LOW or QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW, then QACCEPTn is LOW or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is LOW, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW, then QDENY is LOW or QREQn is LOW in the next cycle.",
    "If QACCEPTn is LOW, then QDENY is LOW or QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW, then QDENY is LOW or RESETn is LOW in the next cycle.",
    "If QACCEPTn is LOW, then QDENY is LOW or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH, then QACCEPTn is LOW or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If QACCEPTn is HIGH, then QACCEPTn is HIGH or QREQn is LOW in the next cycle.",
    "If QACCEPTn is HIGH, then QACCEPTn is HIGH or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH, then QDENY is LOW or RESETn is LOW in the next cycle.",
    "If QACCEPTn is HIGH, then QDENY is LOW or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH, then QDENY is HIGH or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH, then QREQn is LOW or RESETn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH, then QREQn is HIGH or RESETn is HIGH in the next cycle.",
    "If QDENY is LOW, then QACCEPTn is LOW or RESETn is HIGH in the next cycle.",
    "If QDENY is LOW, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If QDENY is LOW, then QDENY is LOW or QREQn is LOW in the next cycle.",
    "If QDENY is LOW, then QDENY is LOW or RESETn is LOW in the next cycle.",
    "If QDENY is LOW, then QDENY is LOW or RESETn is HIGH in the next cycle.",
    "If QREQn is HIGH and RESETn is LOW, then QREQn is HIGH in the next cycle.",
    "If QREQn is HIGH and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QREQn is HIGH and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is LOW, then QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QREQn is HIGH in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QREQn is HIGH in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QACCEPTn is LOW in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QDENY is LOW in the next cycle.",
    "If QREQn is HIGH and RESETn is LOW, then QREQn remains stable in the next cycle.",
    "If QREQn is HIGH and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QREQn is HIGH and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is LOW, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QREQn is HIGH and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QREQn remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is LOW and QDENY is LOW and QREQn is HIGH and RESETn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QDENY is HIGH and QREQn is LOW, then QACCEPTn is HIGH in the next cycle.",
    "If QDENY is HIGH and QREQn is LOW, then QDENY is HIGH in the next cycle.",
    "If QDENY is HIGH and QREQn is HIGH, then QREQn is HIGH in the next cycle.",
    "If QDENY is HIGH and QREQn is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is LOW, then QACCEPTn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is LOW, then QDENY is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is HIGH, then QREQn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QDENY is HIGH and QREQn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QDENY is HIGH and QREQn is LOW, then QDENY remains stable in the next cycle.",
    "If QDENY is HIGH and QREQn is HIGH, then QREQn remains stable in the next cycle.",
    "If QDENY is HIGH and QREQn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is LOW, then QACCEPTn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is LOW, then QDENY remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is HIGH, then QREQn remains stable in the next cycle.",
    "If QACCEPTn is HIGH and QDENY is HIGH and QREQn is HIGH, then QACCEPTn remains stable in the next cycle.",
    "If QDENY changes from LOW to HIGH, then QREQn is LOW.",
    "If QDENY changes from LOW to HIGH, then QACCEPTn is HIGH.",
    "If QDENY changes from HIGH to LOW, then QREQn is HIGH.",
    "If QDENY changes from HIGH to LOW, then QACCEPTn is HIGH.",
    "If QDENY changes from LOW to HIGH, then QACCEPTn is HIGH and QDENY is HIGH.",
    "If QDENY changes from LOW to HIGH, then QACCEPTn is HIGH and QREQn is LOW.",
    "If QDENY changes from LOW to HIGH, then QDENY is HIGH and QREQn is LOW.",
    "If QDENY changes from HIGH to LOW, then QACCEPTn is HIGH and QDENY is LOW.",
    "If QDENY changes from HIGH to LOW, then QACCEPTn is HIGH and QREQn is HIGH.",
    "If QDENY changes from HIGH to LOW, then QDENY is LOW and QREQn is HIGH.",
    "If QDENY is HIGH, then QACCEPTn is HIGH.",
    "If QDENY is HIGH, then QACCEPTn is HIGH in the next cycle.",
    "If QDENY is HIGH, then QACCEPTn is HIGH or QDENY is LOW in the next cycle.",
    "If QDENY is HIGH, then QACCEPTn is HIGH or QDENY is HIGH in the next cycle.",
    "If QDENY is HIGH, then QACCEPTn is HIGH or QREQn is LOW in the next cycle.",
    "If QDENY is HIGH, then QACCEPTn is HIGH or QREQn is HIGH in the next cycle.",
    "If QDENY is HIGH, then QDENY is HIGH or QREQn is HIGH in the next cycle."
]